@echo off
set  Wait=10
set  Interval=5
set  Times=1


%~dp0\src\f11.vbs
@REM start mshta vbscript:createobject("wscript.shell").run("%~dp0\src\lock.bat %Wait% %Interval% %Times%",0)(window.close)

for /L %%i in (%Wait%,-1,1) do (
  cls
  echo=
  echo=
  echo=
  echo=
  echo=
  echo=
  echo=
  echo=
  echo=
  echo=
  echo=
  echo=
  echo=
  echo=
  echo=
  echo                            ¡ö                                                                                                    ¡ö¡ö¡ö              ¡ö¡ö¡ö                                                ¡ö¡ö¡ö
  echo                          ¡ö¡ö¡ö¡ö                                                  ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                    ¡ö¡ö¡ö              ¡ö¡ö¡ö                                                ¡ö¡ö¡ö
  echo                        ¡ö¡ö¡ö¡ö                                                    ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                    ¡ö¡ö¡ö              ¡ö¡ö¡ö                                                ¡ö¡ö¡ö
  echo                  ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö    ¡ö¡ö¡ö                ¡ö¡ö                    ¡ö¡ö¡ö              ¡ö¡ö¡ö                                                ¡ö¡ö¡ö
  echo              ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö    ¡ö¡ö¡ö                ¡ö¡ö            ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö  ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                                      ¡ö¡ö¡ö
  echo        ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                ¡ö¡ö¡ö                  ¡ö¡ö      ¡ö¡ö¡ö    ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö            ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö  ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                                      ¡ö¡ö¡ö                ¡ö
  echo      ¡ö¡ö¡ö¡ö¡ö¡ö¡ö                  ¡ö¡ö¡ö                    ¡ö¡ö      ¡ö¡ö¡ö    ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                    ¡ö¡ö¡ö        ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                                      ¡ö¡ö¡ö              ¡ö¡ö¡ö
  echo        ¡ö¡ö¡ö      ¡ö¡ö            ¡ö¡ö¡ö¡ö                    ¡ö¡ö      ¡ö¡ö¡ö    ¡ö¡ö¡ö                ¡ö¡ö                    ¡ö¡ö¡ö              ¡ö¡ö¡ö      ¡ö¡ö                                      ¡ö¡ö¡ö            ¡ö¡ö¡ö
  echo                  ¡ö¡ö¡ö¡ö        ¡ö¡ö¡ö¡ö                      ¡ö¡ö      ¡ö¡ö¡ö    ¡ö¡ö¡ö                ¡ö¡ö                    ¡ö¡ö¡ö              ¡ö¡ö¡ö      ¡ö¡ö                ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö    ¡ö¡ö¡ö¡ö        ¡ö¡ö¡ö¡ö
  echo                    ¡ö¡ö¡ö    ¡ö¡ö¡ö¡ö¡ö                        ¡ö¡ö      ¡ö¡ö¡ö    ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                    ¡ö¡ö¡ö    ¡ö        ¡ö¡ö        ¡ö¡ö                ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö    ¡ö¡ö¡ö¡ö      ¡ö¡ö¡ö¡ö
  echo                      ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                          ¡ö¡ö      ¡ö¡ö¡ö    ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                    ¡ö¡ö¡ö¡ö¡ö¡ö  ¡ö¡ö¡ö¡ö¡ö        ¡ö¡ö                            ¡ö¡ö¡ö    ¡ö¡ö¡ö¡ö    ¡ö¡ö¡ö¡ö
  echo                ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                              ¡ö¡ö      ¡ö¡ö¡ö        ¡ö¡ö                                ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö        ¡ö¡ö¡ö                          ¡ö¡ö¡ö    ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö
  echo          ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö      ¡ö¡ö¡ö                      ¡ö¡ö      ¡ö¡ö¡ö      ¡ö¡ö¡ö                            ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö      ¡ö¡ö¡ö¡ö¡ö        ¡ö¡ö¡ö                          ¡ö¡ö      ¡ö¡ö¡ö¡ö¡ö¡ö¡ö
  echo          ¡ö¡ö¡ö¡ö¡ö¡ö¡ö          ¡ö¡ö¡ö¡ö                      ¡ö¡ö      ¡ö¡ö¡ö    ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö      ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö            ¡ö¡ö¡ö¡ö      ¡ö¡ö¡ö                        ¡ö¡ö¡ö      ¡ö¡ö¡ö¡ö¡ö¡ö¡ö
  echo                              ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö          ¡ö¡ö      ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                ¡ö¡ö¡ö          ¡ö¡ö¡ö¡ö¡ö¡ö    ¡ö¡ö¡ö  ¡ö¡ö¡ö                ¡ö¡ö¡ö      ¡ö¡ö¡ö  ¡ö¡ö¡ö
  echo                          ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö          ¡ö¡ö      ¡ö¡ö¡ö¡ö¡ö¡ö          ¡ö          ¡ö¡ö¡ö                ¡ö¡ö¡ö          ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö  ¡ö¡ö¡ö              ¡ö¡ö¡ö        ¡ö¡ö¡ö  ¡ö¡ö¡ö¡ö
  echo                ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö          ¡ö¡ö      ¡ö¡ö¡ö¡ö¡ö            ¡ö¡ö        ¡ö¡ö¡ö                ¡ö¡ö¡ö        ¡ö¡ö¡ö      ¡ö¡ö    ¡ö¡ö  ¡ö¡ö                ¡ö¡ö¡ö        ¡ö¡ö¡ö    ¡ö¡ö¡ö¡ö
  echo          ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                  ¡ö¡ö¡ö¡ö          ¡ö¡ö      ¡ö¡ö¡ö    ¡ö¡ö¡ö    ¡ö¡ö¡ö        ¡ö¡ö¡ö        ¡ö¡ö  ¡ö¡ö¡ö¡ö      ¡ö¡ö¡ö        ¡ö      ¡ö¡ö¡ö¡ö¡ö              ¡ö¡ö¡ö          ¡ö¡ö¡ö      ¡ö¡ö¡ö
  echo            ¡ö¡ö¡ö¡ö¡ö                      ¡ö¡ö¡ö¡ö            ¡ö¡ö      ¡ö¡ö¡ö    ¡ö¡ö¡ö    ¡ö¡ö¡ö¡ö¡ö    ¡ö¡ö¡ö          ¡ö¡ö¡ö¡ö¡ö      ¡ö¡ö¡ö¡ö                  ¡ö¡ö¡ö¡ö              ¡ö¡ö¡ö          ¡ö¡ö¡ö        ¡ö¡ö¡ö
  echo                        ¡ö¡ö¡ö            ¡ö¡ö¡ö¡ö              ¡ö¡ö      ¡ö¡ö¡ö    ¡ö¡ö¡ö¡ö¡ö¡ö    ¡ö¡ö¡ö  ¡ö¡ö¡ö          ¡ö¡ö¡ö¡ö          ¡ö¡ö                      ¡ö¡ö              ¡ö¡ö¡ö            ¡ö¡ö¡ö          ¡ö¡ö¡ö
  echo                        ¡ö¡ö¡ö¡ö        ¡ö¡ö¡ö¡ö                ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö    ¡ö¡ö¡ö¡ö¡ö        ¡ö¡ö  ¡ö¡ö¡ö                                                  ¡ö                  ¡ö¡ö¡ö¡ö            ¡ö¡ö¡ö          ¡ö¡ö¡ö¡ö
  echo                          ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                  ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö    ¡ö¡ö¡ö                  ¡ö¡ö¡ö            ¡ö¡ö                    ¡ö¡ö        ¡ö¡ö¡ö            ¡ö¡ö¡ö¡ö                ¡ö¡ö¡ö              ¡ö¡ö¡ö¡ö
  echo                            ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                    ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö    ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö    ¡ö¡ö¡ö            ¡ö¡ö¡ö    ¡ö¡ö¡ö        ¡ö¡ö¡ö      ¡ö¡ö¡ö            ¡ö¡ö¡ö¡ö                ¡ö¡ö¡ö              ¡ö¡ö¡ö¡ö¡ö
  echo                          ¡ö¡ö¡ö¡ö¡ö¡ö¡ö                        ¡ö¡ö      ¡ö¡ö¡ö    ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö    ¡ö¡ö¡ö          ¡ö¡ö¡ö        ¡ö¡ö        ¡ö¡ö¡ö        ¡ö¡ö¡ö          ¡ö¡ö¡ö                  ¡ö¡ö¡ö                ¡ö¡ö¡ö
  echo      ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                              ¡ö¡ö                                        ¡ö¡ö¡ö        ¡ö¡ö¡ö¡ö        ¡ö¡ö¡ö        ¡ö¡ö          ¡ö¡ö¡ö                                ¡ö¡ö¡ö                    ¡ö
  echo      ¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö¡ö                                                                      ¡ö¡ö¡ö¡ö¡ö¡ö          ¡ö¡ö¡ö          ¡ö¡ö¡ö        ¡ö¡ö¡ö        ¡ö¡ö¡ö                        ¡ö¡ö¡ö¡ö¡ö¡ö¡ö
  echo        ¡ö¡ö¡ö¡ö¡ö¡ö                                                                                ¡ö¡ö¡ö¡ö¡ö            ¡ö¡ö            ¡ö¡ö¡ö        ¡ö¡ö¡ö          ¡ö¡ö                        ¡ö¡ö¡ö¡ö¡ö¡ö
  echo                                                                                                                            ¡ö                          ¡ö
  echo=
  echo=
  echo=
  echo=
  echo=
  echo=
  echo=
  echo                                                                               ¼ÈÈ»ÒÑ¾­996ÁË£¬ÎªÊ²Ã´»¹²»¶à»®»®Ë®£¿ÊÇÏëµÃ°×ÄÚÕÏ£¿¾±×µ²¡£¿Éö½áÊ¯£¿Ñü¼¡ÀÍËð£¿»¹ÊÇÏëâ§[31mËÀ[0m£¿
  echo=
  echo=
  echo=
  echo=
  echo=
  echo=
  echo=
  echo                                                                                                        ¸øÄã%%iÃë£¬ÂíÉÏÈ¥ºÈË®£¬·ñÔòÇ¿ÖÆ¹Ø»ú!
  echo=
  echo=
  echo=
  echo=
  echo=
  echo=
  echo=
  choice /t 1 /d y /n >nul
)
